// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Acest software trebuie instalat pe partitia de boot.";
"ERROR_INSTALL" = "Aceasta partitie nu corespunde cerintelor necesare instalarii.";

"Newer_Package_Installed_message" = "O versiune mai noua Chameleon este deja prezenta!";
"Intel_Mac_message" = "Acest software nu poate fi instalat pe acest computer.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Tipul Instalarii";
"InstallType_description" = "Alegeti intre o instalare noua sau un upgrade al unei instalari prezente.";

"New_title" = "Instalare Noua";
"New_description" = "Se va face backup folderului /Extra de pe partitia aleasa, va fi creat un folder /Extra nou in cazul in care este aleasa orice alta optiune in afara de bootloader.";

"Upgrade_title" = "Upgrade";
"Upgrade_description" = "Setariile selectate vor fi combinate cu cele prezente deja din folderul /Extra, dar pentru siguranta, se va face un backup folderului /Extra prezent.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Bootloaderul Chameleon";
"Chameleon_description" = "Chameleon necesita trei fisiere principale. (la modul cel mai simplu)
boot0 (Pe MBR-ul Discului) responsabil pentru incarcarea boot1.
boot1 (Pe sectorul de boot al partitiei) pentru a gasi boot2.
boot2 (In directorul principal al partitiei) pentru incarcarea kernelului, etc.";

"Standard_title" = "Standard";
"Standard_description" = "Instalarea Chameleon in directorul principal al partitiei selectate, folosind boot0 sau boot0md in functie de configuratia sistemului, fara a distruge o instalare de Windows daca aceasta e prezenta.";

"EFI_title" = "EFI";
"EFI_description" = "Instalarea Chameleon in partitia EFI (de obicei ascunsa) folosind boot0 sau boot0md in functie de configuratia sistemului, fara a distruge o instalare de Windows daca aceasta e prezenta.";

"noboot_title" = "Fara instalarea Bootloaderului";
"noboot_description" = "Folositor in cazul in care se doreste instalarea extra-uriilor doar.";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Module";
"Module_description" = "Sistemul modular al bootloaderului Chameleon permite developeriilor sa extinda functionalitatea de baza fara a modifica fisierul principal de boot.";


"klibc_title" = "klibc";
"klibc_description" = "Acest modul ofera o librarie C pentru modulele carora libraria implicita din Chameleon nu este suficienta.
Acest modul e folosit doar cu  libraria uClibc++.
Sursa: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Rezolutie";
"AutoReso_description" = "Acest modul citeste informatia EDID a monitorului conectat la placa video, si seteaza rezolutia corect in functie de acesta. Modulul momentan nu este inclus in Chameleon iar folosirea sa este foarte rara.
De asemenea la cazul placiilor pre-Intel HD, acest modul corecteaza moduriile VESA, setand o rezolutie corecta in timpul procesului de boot.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Acest modul ofera o librarie minimala C++ pentru alte module ce au nevoie de functionalitatea extinsa.Acest modul nu ofera nici o facilitate in forma individuala.
*rtti si exceptiile au fost dezactivate.
Sursa: http://cxx.uclibc.org/
Dependente: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "Acest modul ofera posibilitatea folosirii aranjamentelor de tastaturi diferite.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utilitati";
"Utility_description" = "Fisiere optionale, ajutatoare configurarii.";

"PrefPanel_title" = "Panou de preferinte";
"PrefPanel_description" = "Instaleaza panoul de preferinte pentru Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Copiaza un exemplu al fisierului smbios.plist in /Extra/Configuration.";

"Documentation_title" = "Documentatie";
"Documentation_description" = "Documentatie pentru chameleon, instalare manuala si utilizare.";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Setari";
"Options_description" = "Creaza un fisier /Extra/org.chameleon.Boot.plist prin selelectarea oricarei optiuni sau flag pentru kernel.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Ascunde informatiile din partea stranga sus, precum ar fi versiunea Chameleon, etc.";

"GUI_title" = "GUI=No";
"GUI_description" = "Dezactiveaza interfata grafica implicit activa.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Folosirea logoului apple normal, gri pe fundal gri deschis, in loc de cel inclus in tema 'boot.png'.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Initial, Chameleon afiseaza partitia setata pentru boot, si cursorul ce scade pana la procesul de boot daca nici o tasta nu este atinsa.
Aceasta setare obliga Chameleon sa afiseze toata lista de partitii direct.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Activeaza modul silentios de boot (nici un mesaj sau notificare).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Activeaza afisarea de informatii in partea stanga sub boot banner, cum ar fi rezolutia, discul de boot, partitia, etc. Aceasta setare este recomandata pentru depistarea problemelor.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Opreste procesul de boot al OS X dupa ce Chameleon a fost initializat, asteptand o tasta sa fie apasata pentru a incarca kernelul si sistemul.
Optiune de asemenea recomandata pentru depistarea problemelor, in combinatie cu modul verbose.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Porneste kernelul in modul 32 bit in loc de modul natural 64bit.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Activati optiunea pentru a repara orice problema de access EHCI in cazul biosuriilor cu defecte.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Activati aceasta optiune pentru a seta modul integrat al placiilor de retea.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Activeaza modul HPET pe chipseturi Intel care nu au optiunea HPET in bios.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Aceasta optiune permite sistemului sa ignore imaginiie de sleep defecte.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Dezactiveaza patchul pentru restart prezent implicit.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Activati optiunea pentru a reseta controlerele UHCI inainte de pornirea sistemului OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Dezactiveaza auto-detectarea memoriei RAM.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Pentru Lion doar, sistemul va incarca kernelul deja configurat cu extensii, ignorand /E/E si /S/L/E. Folositi aceasta optiune DOAR daca stiti ca in cache-ul kernelului sunt incluse toate extensiile de care are nevoie sistemul.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Incercare de a incarca imaginea salvata la ultima hibernare.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Noul mod de generare C-State _CST folosind registrele SystemIO in loc de FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Ingorarea tabelelor SSDT incluse in biosul placii de baza.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Activeaza modul de energie al procesorului, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Activeaza modul de energie al procesorului, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Activeaza modul de energie al procesorului, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Activeaza timpii 'idle' ai procesorului (C-States).";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Activeaza auto-generarea moduriilor de energie ale procesorului (P-States).";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Setarea rezolutiei la 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Setarea rezolutiei la 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Setarea rezolutiei la 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Setarea rezolutiei la 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Setarea rezolutiei la 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Setarea rezolutiei la 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Setarea rezolutiei la 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Setarea rezolutiei la 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Setarea rezolutiei la 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Setarea rezolutiei la1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Setarea rezolutiei la 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Activeaza auto-detectarea placii video nVidia si injectarea proprietatiilor.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Activeaza optiuniile UseAtiROM.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Activeaza optiuniile UseNvidiaROM.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Activeaza optiunea VBIOS";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Modul Verbose";
"Verbose_description" = "Activeaza afisarea de informatii detalitate in timpul procesului de boot, optiune vitala pentru depistarea problemelor.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "Optiune pentru depistare a problemelor, care porneste direct in consola BSD/UNIX a sistemului OS X.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "O optiune rar folosita, dar practica in cazul in care se doreste pornirea sistemului cu toate fisierele si ignorand cache-uriile prezente.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Pentru rezolvarea blocarii la 'PCI configuration begin' pe unele sisteme. 0x2000 este flagul kIOPCIConfiguratorPFM64, precum este prezentat in codul sursa IOPCIFamily.";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "Pentru rezolvarea blocarii la 'PCI configuration begin' pe unele sisteme. 0x3000 este flagul kIOPCIConfiguratorPFM64, precum este prezentat in codul sursa IOPCIFamily.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Pentru Lion doar, dezactiveaza modul de revenire 'low power' care uneori lasa ecranul negru.";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Tastatura MAC in limba Germana";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Tastatura MAC in limba Spaniola";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Tastatura MAC in limba Franceza";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Tastatura MAC in limba Italiana";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Tastatura MAC in limba Suedeza";

"mac-pt_title" = "Portuguese Mac Keyboard";
"mac-pt_description" = "Tastatura MAC in limba Portugheza";

"pc-de_title" = "German PC Keyboard";
"pc-de_description" = "Tastatura PC in limba Germana";

"pc-es_title" = "Spanish PC Keyboard";
"pc-es_description" = "Tastatura PC in limba Spaniola";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Tastatura PC in limba Franceza";

"pc-it_title" = "Italian PC Keyboard";
"pc-it_description" = "Tastatura PC in limba Italiana";

"pc-se_title" = "Swedish PC Keyboard";
"pc-se_description" = "Tastatura PC in limba Suedeza";

"pc-pt_title" = "Portuguese PC Keyboard";
"pc-pt_description" = "Tastatura PC in limba Portugheza";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "O versiune minimala a temei inregrate in chameleon.";

"Legacy_title" = "Legacy";
"Legacy_description" = "Tema originala Chameleon introdusa in versiunea v2.0 RC1";

"Default_title" = "Standard";
"Default_description" = "Tema originala Chameleon introdusa in versiunea v2.0 RC5";

"Bullet_title" = "Bullet";
"Bullet_description" = "O tema simpla creata de NoSmokingBandit din Aprilie 2009.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Optiuni pentru control";
"Control_description" = "Optiuni pentru a controla modul de functionare a bootloaderului Chameleon.";

// General
"General_title" = "Optiuni Generale";
"General_description" = "Alegeti din o gama de optiuni de baza.";

// KernelFlags
"KernelFlags_title" = "Flag-uri pentru kernel";
"KernelFlags_description" = "Alegeti din o gama de flag-uri pentru kernel.";

// PowerManagement
"PowerManagement_title" = "Management al energiei";
"PowerManagement_description" = "O selectie de optiuni care au de aface cu speedstep si consumul de energie.";

// Resolution
"Resolution_title" = "Rezolutie";
"Resolution_description" = "Setati o rezolutie implicita.";

// Video
"Video_title" = "Video";
"Video_description" = "O selectie de optiuni care au de aface cu functionarea video.";

// Keymaps
"Keymaps_title" = "Tastatura";
"Keymaps_description" = "Selectati o limba a tastaturii, aceasta va instala si modulul pentru diverse limbi.";

// Themes
"Themes_title" = "Teme";
"Themes_description" = "O colectie de teme exemplu, pentru mai multe teme vizitati adresa: http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "Nimic";
"ChooseNone-Resolution_description" = "Nu alegeti o rezolutie.";

"ChooseNone-keylayout_title" = "Nimic";
"ChooseNone-keylayout_description" = "Nu alegeti un mod al tastaturii.";
